tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "homebrew/cask-drivers"
tap "helix-editor/helix"
brew "mas"
# brew "poppler"
# brew "cloc"
# brew "mysql"
# brew "neovim"
brew "htop"
brew "imagemagick"
# brew "potrace"
# brew "tcl-tk"
brew "bottom"
# brew "autojump"
brew "cmake"
brew "pyenv"
brew "ripgrep"
# brew "tmux"
brew "tree"
brew "zsh"
brew "wget"
brew "pandoc"
# brew "mariadb"
brew "zellij"
brew "helix"
brew "coreutils"
brew "nushell"
brew "zoxide"
brew "starship"
brew "bat"
brew "exa"
brew "gitui"
brew "pyenv-virtualenv"
brew "neovim"

# for pyenv
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "svn"
brew "juliaup"
cask "font-source-code-pro"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-blex-mono-nerd-font"
# cask "font-source-code-pro-for-powerline"
cask "font-hack-nerd-font"
cask "iterm2"
cask "obsidian"
cask "texstudio"
cask "mactex"
cask "firefox"
cask "omnidisksweeper"
cask "appcleaner"
cask "tidal"
cask "sonos"
cask "emacs"
cask "raycast"
cask "warp"
cask "visual-studio-code"
cask "aldente"
cask "neovide"
cask "quarto"
